Autodesk.Revit.DB.BuiltInFailures.MassFailures.FloorRecreateFailedWarning
The floor cannot be created because no suitable level in the target document can be found.

Autodesk.Revit.DB.BuiltInFailures.MassFailures.FloorRecreateFailed
The floor cannot be created.